{
	"title": "Join | MetalCow Robotics",
	"attr": {
		"page-body" : {
			"class" : "page page-template page-template-template-fullwidth-no-title page-template-template-fullwidth-no-title-php group-blog"
		},
	  	"join-button" : {
	      	"class" : "menu-item menu-item-type-post_type menu-item-object-page current-menu-item current_page_item"
	  	},
	  	"mentor-button" : {
	      	"class" : "menu-item menu-item-type-post_type menu-item-object-page"
	  	},
	  	"sponsor-button" : {
	      	"class" : "menu-item menu-item-type-post_type menu-item-object-page"
	  	}
	},
	"body": {
		"content": "<div class='container'> <div class='content-left-wrap col-md-12'> <div id='primary' class='content-area'> <main id='main' class='site-main' role='main'> <article id='post-26' class='post-26 page type-page status-publish hentry'> <div class='entry-content'> <p> MetalCow Robotics Team 4213 is a part of FIRST, a non-profit organization, which promotes science and technology and 4-H. We are a community-based team and accept public, private, and homeschool students. We have been in existence for 5 years and have done extraordinary things in that time. Students on the team will work with engineers and professionals from local companies and businesses to design and build a 120 lb. robot in six weeks. We have activities and meet year round. However, the build- season starts in early January and goes to about mid-March. During this time we typically meet Monday, Tuesday, Thursday, and Friday from 5:30 to 8:30 and Saturday from 9 to 4. More meeting time may be added before the end of the season depending on progress of the robot. The team travels during the competition season, which is early March through April depending on the events the team signs up for and how far we advance. </p><p> Some student expectations include: </p><ul> <li>Must be high school age </li><li>Adhere to the MetalCow Robotics 4213 Handbook </li><li>Put in a minimum of 12 hours per week during the build and competition seasons </li><li>Set up an account on team forum and check it daily </li><li>Attend outreach events </li><li>Be involved in fundraising events </li><li>Register with FIRST online </li><li>Attend mandatory meetings </li></ul> <p> Eligibility criteria: Citizen of McLean County, Member of 4H, etc… </p><p> Please fill out the following application to your best ability. In addition to this application, a short non-formal group interview will be conducted to determine your acceptance on the team. These interviews will be laid back, will last no longer than 15 minutes, and will be conducted with more than 1 applicant at a time. Returning members must complete a shortened application in order to provide feedback to the team on the previous season. Additionally, returning members must conduct an individual performance review in lieu of an interview. Make sure you plan enough time to complete the entire application at one time. If you have any questions, comments, or concerns please don’t hesitate to contact us. </p><p> The deadline to submit this application is August 15th.<br>Didn’t hear about the team till after the August 15th deadline? No problem. Please go ahead and fill out the application and send an email to teammetalcow@gmail.com indicating the reason for the late application and to be considered for the team. </p><hr> <p> <iframe src='https://docs.google.com/forms/d/19Bw2W9gLD_hP37BNJNLvCFKkeMMXBo65DUae0bs9Kwc/viewform?embedded=true' width='100%' height='1200'>Loading…</iframe> </p></div></article> </main> </div></div></div>"
	},
  "foot": "<script type='text/javascript' src='js/zerif.js'></script>"
}