{
  "title": "Join | MetalCow Robotics",
  "attr": {
    "page-body": {
      "class": "page page-template page-template-template-fullwidth-no-title page-template-template-fullwidth-no-title-php group-blog"
    },
    "join-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page current-menu-item current_page_item"
    },
    "mentor-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page"
    },
    "sponsor-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page"
    }
  },
  "body": {
    "content": "<div class=\"container\"><div class=\"content-left-wrap col-md-12\"><div id=\"primary\" class=\"content-area\"><main id=\"main\" class=\"site-main\" role=\"main\"><article id=\"post-26\" class=\"post-26 page type-page status-publish hentry\"><div class=\"entry-content\"><p>MetalCow Robotics Team 4213 isa part of FIRST, a non-profitorganization, which promotesscience and technology and 4-H.We are a community-based teamand accept public, private, andhomeschool students. We havebeen in existence for 5 yearsand have done extraordinaryhings in that time. Studentson the team will work withengineers and professionalsfrom local companies andbusinesses to design and builda 120 lb. robot in six weeks.We have activities and meetyear round. However, the build-season starts in early Januaryand goes to about mid-March.During this time we typicallymeet Monday, Tuesday, Thursday,and Friday from 5:30 to 8:30and Saturday from 9 to 4. Moremeeting time may be addedbefore the end of the seasondepending on progress of therobot. The team travels duringhe competition season, whichis early March through Aprildepending on the events theeam signs up for and how farwe advance.</p><p>Some student expectationsinclude:</p><ul><li>Must be high school age</li><li>Adhere to the MetalCowRobotics 4213 Handbook</li><li>Put in a minimum of 12hours per week during the buildand competition seasons</li><li>Set up an account on teamforum and check it daily</li><li>Attend outreach events</li><li>Be involved in fundraisingevents</li><li>Register with FIRST online</li><li>Attend mandatory meetings</li></ul><p>Eligibility criteria: Citizenof McLean County, Member of 4H,etc…</p><p>Please fill out the followingapplication to your bestability. In addition to thisapplication, a short non-formalgroup interview will beconducted to determine youracceptance on the team. Theseinterviews will be laid back,will last no longer than 15minutes, and will be conductedwith more than 1 applicant at aime. Returning members mustcomplete a shortenedapplication in order to providefeedback to the team on theprevious season. Additionally,returning members must conductan individual performancereview in lieu of an interview.Make sure you plan enough timeo complete the entireapplication at one time. If youhave any questions, comments,or concerns please don’thesitate to contact us.</p><p>The deadline to submit thisapplication is August 15th.<br>Didn’t hear about the team tillafter the August 15th deadline?No problem. Please go ahead andfill out the application andsend an email toeammetalcow@gmail.comindicating the reason for thelate application and to beconsidered for the team.</p><hr><p><iframe src=\"https://docs.google.com/forms/d/19Bw2W9gLD_hP37BNJNLvCFKkeMMXBo65DUae0bs9Kwc/viewform?embedded=true\" width=\"100%\" height=\"1200\">Loading…</iframe></p></div><!-- .entry-content --></article><!-- #post-## --></main><!-- #main --></div><!-- #primary --></div><!-- .content-left-wrap --></div><!-- .container -->"
  },
  "foot": "<script type='text/javascript' src='js/zerif.js'></script>"
}
