{
  "title": "Our Robots | MetalCow Robotics",
  "attr": {
    "page-body": {
      "class": "page page-template page-template-template-fullwidth-no-title page-template-template-fullwidth-no-title-php group-blog"
    },
    "join-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page"
    },
    "mentor-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page"
    },
    "sponsor-button": {
      "class": "menu-item menu-item-type-post_type menu-item-object-page"
    }
  },
  "body": {
    "content": "<div class=\"container\"><div class=\"content-left-wrap col-md-12\"><div id=\"primary\" class=\"content-area\"><main id=\"main\" class=\"site-main\" role=\"main\"><article id=\"post-152\" class=\"post-152 page type-page status-publish hentry\"><div class=\"entry-content\"><p>MetalCow Robotics was founded in November 2011 underhe guidance of McLean County Co-operative Extensionwith founding grants from JCPenney and University ofIllinois Extension to form a FIRST Robotics team. Thispartnership is an effort to provide new and excitingopportunities to local high school youth in McLean,Woodford, and Livingston Counties.</p><h1 id=\"ellie\">Ellie<br><small>Recycle Rush, <em>2015</em></small></h1><p><img class=\"size-medium wp-image-27 alignright\" src=\"img/s/robot-ellie-218x300.jpg\" alt=\"robot-ellie\" width=\"218\" height=\"300\"><br>2015 was our fourth season and the senior year of manyof our founding members. We started with a large grantfrom State Farm which helped the team purchase moreools, laptops, and supplies. We also attracted morepeople bringing the team up to 17 students and severalnew mentors. We participated in three regionalcompetitions and as a wild card at World’s. Although wedid not rank high nor get selected to a week 1 alliancein Little Rock, we successfully tweaked our robot inpreparation for the rest of our season. Following thatwe ended up on 6<sup>th</sup> seeded alliance in Peoriaand Cincinnati and a top ranked team in our division atWorld’s.</p><p><img class=\"alignleft\" src=\"img/Slide-Drivetrain-300x181.png\" alt=\"via simbotics.org\" width=\"300\" height=\"181\">&lt;/&gt;Ellie was designed with an elevator liftin mind. We had two lead screws to elevate the armshat could lift over 60 pounds. We also a jump slidedrive system which consisted of 5 omni-wheels; two oneach side and one in the middle going sideways. Withhat drive train we were able to precisely movesideways to properly align ourselves with fieldelements.</p><p>Recycle Rush is a recycling -themed game played by twoAlliances of three robots each. Robots score points bystacking totes on scoring platforms, capping thosestacks with recycling containers, and properlydisposing of pool noodles, representing litter. Totesare collected either from the landfill located on thefar end of the field or from the human player station.Ellie was created to work from the human player stationand can create one six stack of totes with a recyclingcan and litter on top scoring 36 points.</p><hr><h1 id=\"daisy\">Daisy<br><small>Aerial Assist, <em>2014</em></small></h1><p>MetalCow’s third year saw even more success. Wefinished our robot early and designed a robot tocompete in all phases of the game <i>Aerial Assist.</i>Fifteen members competed in the first week ofcompetition at the Central Illinois Regional at thePekin, IL AvantiDome and the 4th week of competition athe Purdue Boilermaker Regional. Along with ourCreativity Award for our unique catching design, weearned alliance selections on the second seededalliance in Pekin and the number one pick on the topseeded alliance at Purdue. More than anything, we hadproven ourselves as an up and coming veteran team whichhelped secure a large corporate donation to expand ourprogram.</p><p><img class=\"alignleft\" src=\"http://static1.squarespace.com/static/51919127e4b03488d35e808e/t/534ad840e4b0dd40982f3cfd/1397413966034/20140215_114341.jpg?format=500w\" alt=\"20140215_114341.jpg\" width=\"426\" height=\"568\"></p><p>Aerial Assist is a game styled similarly to a over-sized basketball game. Robots must either catch orpick up 25in diameter exercise balls from the ground orfrom the human player. There are multiple ways to scorepoints. A high goal is equal to 10 points and a lowgoal is equal to 1 point. If you pass once you gain anextra 10 point for a total of 20 when you score. If youpass twice you gain an extra 20 point for a total of 40when you score. You are also able to throw the ballover a 6 foot tall truss in the middle of the field foran immediate 10 points, also if a robot catches theball thrown over the truss you gain another immediate10 point bonus.</p><p>Daisy was designed for easy catching and throwing; itis able to do this because we extend our sides out fora total of 17 square foot catcher which feeds into ourcatapult that has an estimated 150 lbs launch force.Daisy has four meccanum wheels which, in theory, allowit to move in any direction facing forward except forup and down. It is also able to score into the highgoal or the low goal.</p><hr><h1 id=\"chippy\">Chippy<br><small>Ultimate Assist, <em>2013</em></small></h1><p>The team’s second year brought more members and a morecomplex robot. The team had 15 members. This requireddividing the team members into sub-teams includingmechanical/powerdrive, programming, marketing andlogistics. The game was called <i>Ultimate Ascent</i>and involved throwing Frisbees at a target and climbinga pyramid. We participated at the Crossroads Regionalin Terre Haute, IN. Although the team didn’t advance tohe finals, they took great pride in successfullyexecuting all the game elements. The team alsoparticipated in an animation contest with itsproduction of <i>Jack and the Beanstalk</i> featuringour mascot MetalCow and was awarded the 2013 Award forTechnical Excellence.</p><p><img class=\"alignright\" src=\"http://static1.squarespace.com/static/51919127e4b03488d35e808e/t/51a3d1d8e4b068f76a13afee/1433285744575/Chippy.JPG?format=500w\" alt=\"Chippy.JPG\"></p><p>Ultimate Ascent is a game styled similarly to disc golfor ultimate frisbee. Robots must pick up or collectdisks from feeder stations, and put them into widegoals 10′ off the ground. At the end of the game,robots can climb a metal pyramid to gain more points,with more being awarded for going higher.</p><p>Chippy was designed with a dropout 2 -pneumatic, 2-omni wheel drive -train that enabled us to quicklyservice problems, as well as maneuver and drive quicklyon the field. We use two pneumatic wheels that launchhe disk out into the top goal. At the end of the game,we would latch two hooks on our shooter to the bottombar to pull up off &nbsp;the ground for a 10 pointbonus.</p><hr><h1 id=\"bessie\">Bessie<br><small>Rebound Rumble, <em>2012</em></small></h1><p><img class=\"alignleft\" src=\"http://static1.squarespace.com/static/51919127e4b03488d35e808e/t/51a3d2c0e4b00f4428943703/1369690817028/Bessie.jpg?format=500w\" alt=\"Bessie.jpg\"></p><p>The team of 11 members spent 6 weeks inJanuary/February 2012 building a robot to play in the2012 FIRST <i>Rebound Rumble</i> game. The robot wasdesigned to shoot a basketball into the goal, playdefense, and balance on a bridge. The first competitionwas at the Midwest Regional on March 2012 held at theUIC Pavilion in Chicago, IL. The goal going into thecompetition as a rookie team was to have a runningrobot. We arrived at the competition with two bags ofpartially completed assemblies and left with a fullyfunctioning robot that earned us the Rookie InspirationAward for our efforts and determination to continuallybuild and modify at this competition.</p><p>Rebound Rumble is a game styled similarly tobasketball. Robots must collect basketballs and scorehem into goals of varying heights (More points forhigher goals). Separating the two sides of the fieldare 3 teeter -totter “bridges”, and a bump. At the endof the game, 10 points are given for each robotbalanced on a bridge.</p><p>Bessie was designed to pick up and score balls into thelow goal, and be able to push down the bridge so itcould balance on and travel across.</p></div><!-- .entry-content --></article><!-- #post-## --></main><!-- #main --></div><!-- #primary --></div><!-- .content-left-wrap --></div><!-- .container -->"
  },
  "foot": "<script type='text/javascript' src='js/zerif.js'></script>"
}
