{
	"title" : "Sponsor | MetalCow Robotics",
	"attr": {
		"page-body" : {
			"class" : "page page-template page-template-template-fullwidth-no-title page-template-template-fullwidth-no-title-php group-blog"
		},
	    "join-button" : {
	        "class" : "menu-item menu-item-type-post_type menu-item-object-page"
	    },
	    "mentor-button" : {
	        "class" : "menu-item menu-item-type-post_type menu-item-object-page"
	    },
	    "sponsor-button" : {
	        "class" : "menu-item menu-item-type-post_type menu-item-object-page"
	    }
	},
	"body" : {
		"content" : "<div class='container'> <div class='content-left-wrap col-md-9'> <div id='primary' class='content-area'> <main itemscope itemtype='http://schema.org/WebPageElement' itemprop='mainContentOfPage' id='main' class='site-main' role='main'> <article id='post-9' class='post-9 page type-page status-publish hentry'> <header class='entry-header'> <h1 class='entry-title'> Sponsorship Details </h1><span class='date updated published'>September 11, 2015</span> </header> <div class='entry-content'> <h2> Sponsoring Our Team </h2> <p> Thank you for considering sponsoring the MetalCow Robotics team. Our mission is to promote science, technology, and engineering in the community while helping students gain real world skills they can use for the rest of their lives. </p><p> MetalCow Robotics is a <a href='http://www.4-h.org'>4-H</a> &nbsp;SPIN club that participates in FIRST robotics competitions. But, it is much more than robotics; it is a small business where members learn digital media, advertising, web design, public speaking, business skills, and leadership. </p><p> The team is made up of students ages 13 to 18 from the McLean county area. We manage the business of the team and create robots from the ground up. Our members come from all walks of life which provides a great opportunity to learn how to work together on a common goal. We have adult mentors from the community who are concerned about the future of America, and dedicate their time to make a difference in our lives. </p><p> Building and competing in robotics can be quite expensive and without support from our generous sponsors we could not have the life learning experiences provided by robotics competition. Sponsoring your MetalCow Robotics Team is a great way to support science, technology, engineering and math (STEM) education in the McLean county area. Your donation will go towards registration fees, robot parts, materials, building rent/utilities, competition traveling expenses, and community outreach activities. </p><p> MetalCow Robotics is currently seeking sponsors for the 2015/16 FIRST Robotics Competition season. MetalCow Robotics is a non-profit organization and your sponsorship may be tax-deductible. We need support of sponsors like you to continue to provide this unique opportunity in our community. </p><p> Every sponsor is greatly appreciated and we have several levels of sponsor benefits. </p><h4> Friends of Metal Cow (Donation less than $500) </h4> <ul> <li>Individual or Company Name listed on all our published materials. </li><li>Individual or Company Name, Logo, and website link on MetalCow Robotics website </li><li>(If you wish to remain anonymous, let us know and we will gladly honor your request.) </li></ul> <h4> Silver Level Sponsors (Donation of $500 – $999) </h4> <ul> <li>Small Company Logo on MetalCow Robotics team t-shirt </li><li>Company Name and Logo on team banner used at community outreach and competition events </li></ul> <h4> Gold Level Sponsor (Donation of $1,000 – $2,999) </h4> <ul> <li>Medium Company Logo on MetalCow Robotics team t-shirt </li><li>Company Name and Logo on team banner used at community outreach and competition events </li><li>Company name/logo on the competition robot* </li></ul> <h4> Platinum Level Sponsor (Donation of $3,000 or more) </h4> <ul> <li>Large Company Logo on MetalCow Robotics team t-shirt </li><li>Provide your company a Demonstration or Hands on Workshop </li><li>Company name and logo on the competition robot* </li><li>Company Name – Announced at Regional and National Competitions and other events. </li></ul> <p> * size of identification on the robot will vary based on the size of the robot built. </p><p> We also accept in In-Kind donations. There are many items we would otherwise have to purchase that you could donate such as supplies, materials, tools, meeting/build space or services (printing, screen-printing, banners, etc.). In-Kind sponsors are acknowledged and receive the sponsor benefits commensurate with their donation. </p><p> Are you or your business interested in partnering with our team? Do you have additional questions or want to schedule a team presentation and robot demonstration? Please contact the team at <a href='mailto:teammetalcow@gmail.com'>teammetalcow@gmail.com</a> </p></div></article> </main> </div></div></div>"
	}
}